AirbnbClone/AirBNB/app/views/homes/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  <strong>Host:</strong>
  <%= @home.user.first_name %> <%= @home.user.last_name %>