AirbnbClone/AirBNB/app/controllers/bookings_controller.rb

  def index
    @bookings = Booking.all
---
SELECT "bookings".* FROM "bookings" ORDER BY "bookings"."updated_at" DESC