AirbnbClone/AirBNB/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @user = User.find(params[:id]) # This is similar to User.find(<user_id which was auto generated when creating a new user>)