TaxiTourGuide/app/controllers/tourguides_controller.rb

  def index
    @tourguides = Tourguide.all
---
SELECT "tourguides".* FROM "tourguides"

  def show
    @tourguide = Tourguide.find(params[:id]) # This is similar to tourguide.find(<tourguide_id which was auto generated when creating a new tourguide>)
---
SELECT  "tourguides".* FROM "tourguides" WHERE "tourguides"."id" = ? ORDER BY "tourguides"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]