app/controllers/destinations_controller.rb

SELECT destinations.*, (111.19492664455873 * ABS(destinations.latitude - 41.7466198) * 0.7071067811865475) + (96.29763124613503 * ABS(destinations.longitude - -88.15936889999999) * 0.7071067811865475) AS distance, CASE WHEN (destinations.latitude >= 41.7466198 AND destinations.longitude >= -88.15936889999999) THEN  45.0 WHEN (destinations.latitude <  41.7466198 AND destinations.longitude >= -88.15936889999999) THEN 135.0 WHEN (destinations.latitude <  41.7466198 AND destinations.longitude <  -88.15936889999999) THEN 225.0 WHEN (destinations.latitude >= 41.7466198 AND destinations.longitude <  -88.15936889999999) THEN 315.0 END AS bearing FROM "destinations" WHERE (destinations.latitude BETWEEN 41.29695899704063 AND 42.19628060295936 AND destinations.longitude BETWEEN -88.76205328173451 AND -87.55668451826547) ORDER BY distance ASC
---
  def index
    @destinations = Destination.all

SELECT destinations.*, (111.19492664455873 * ABS(destinations.latitude - 16.4195724) * 0.7071067811865475) + (96.29763124613503 * ABS(destinations.longitude - 120.6278916) * 0.7071067811865475) AS distance, CASE WHEN (destinations.latitude >= 16.4195724 AND destinations.longitude >= 120.6278916) THEN  45.0 WHEN (destinations.latitude <  16.4195724 AND destinations.longitude >= 120.6278916) THEN 135.0 WHEN (destinations.latitude <  16.4195724 AND destinations.longitude <  120.6278916) THEN 225.0 WHEN (destinations.latitude >= 16.4195724 AND destinations.longitude <  120.6278916) THEN 315.0 END AS bearing FROM "destinations" WHERE (destinations.latitude BETWEEN 16.32964023940813 AND 16.50950456059187 AND destinations.longitude BETWEEN 120.53413584240487 AND 120.72164735759513 AND destinations.id != 2) ORDER BY distance ASC
---
  def show
    @destination = Destination.find(params[:id])

INSERT INTO "destinations" ("d_name", "d_description", "tourguide_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["d_name", "ewrtaw"], ["d_description", "aweasef"], ["tourguide_id", 1], ["created_at", "2017-08-14 09:01:04.746851"], ["updated_at", "2017-08-14 09:01:04.746851"]]
---
  def create
    @destination = current_tourguide.destinations.build(destination_params)

    respond_to do |format|
      if @destination.save

UPDATE "destinations" SET "d_name" = ?, "d_description" = ?, "street" = ?, "city" = ?, "zip_code" = ?, "country" = ?, "latitude" = ?, "longitude" = ?, "updated_at" = ? WHERE "destinations"."id" = ?
---
  def update
    respond_to do |format|
      if @destination.update(destination_params)

SELECT  "destinations".* FROM "destinations" WHERE "destinations"."tourguide_id" = ? AND "destinations"."id" = ? LIMIT ?  [["tourguide_id", 1], ["id", 1], ["LIMIT", 1]]
---
    def set_destination
      @destination = current_tourguide.destinations.find_by(id: params[:id])