app/controllers/users_controller.rb

  def create
    @user = User.new(user_params) #Prevents error screen when invalid sign up
    if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest", "activation_digest") VALUES (?, ?, ?, ?, ?, ?)