TaxiTourGuide/app/views/tourguides/show.html.erb


      <h3>Tourist Spots (<%= @tourguide.destinations.count %>)</h3>
---
SELECT "destinations".* FROM "destinations" WHERE "destinations"."tourguide_id" = ?  [["tourguide_id", 1]]
SELECT COUNT(*) FROM "destinations" WHERE "destinations"."tourguide_id" = ?  [["tourguide_id", 1]]